In [1]:
import pandas as pd

In [2]:
data=pd.read_csv("Titanic-Dataset.csv")

In [3]:
data.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [4]:
reportLines=[]
reportLines.append("Column, Dtype, % Missing ")
for col in data.columns:
    dtype=data[col].dtype
    missing=data[col].isna().mean()*100
    reportLines.append(f"{col}, {dtype}, {missing:.2f}% \n")

In [5]:
with open("inspect_report.txt","w") as file:
    file.writelines(reportLines)

In [6]:
print("Inspect report written sucessfully.")
print("preview (10 lines): ")
print("".join(reportLines[:10]))

Inspect report written sucessfully.
preview (10 lines):
Column, Dtype, % Missing PassengerId, int64, 0.00%
Survived, int64, 0.00%
Pclass, int64, 0.00%
Name, object, 0.00%
Sex, object, 0.00%
Age, float64, 19.87%
SibSp, int64, 0.00%
Parch, int64, 0.00%
Ticket, object, 0.00%

In [7]:
groupMedian=data.groupby(["Pclass","Sex"])["Age"].transform("median")
data["Age"]=data["Age"].fillna(groupMedian)

In [8]:
data["Age"].info()

<class 'pandas.core.series.Series'>
RangeIndex: 891 entries, 0 to 890
Series name: Age
Non-Null Count  Dtype
--------------  -----
891 non-null    float64
dtypes: float64(1)
memory usage: 7.1 KB

In [9]:
if data["Embarked"].mode().size>0:
    embarkedMode=data["Embarked"].mode()[0]
else:
    embarkedMode="S"
data["Embarked"].fillna(embarkedMode)

0      S
1      C
2      S
3      S
4      S
      ..
886    S
887    S
888    S
889    C
890    Q
Name: Embarked, Length: 891, dtype: object

In [10]:
if "Cabin" in data.columns:
    data=data.drop(columns=["Cabin"])

In [11]:
data.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,S

In [12]:
data["familySize"]=data["SibSp"]+data["Parch"]
data["IsAlone"]=(data["familySize"]==0).astype(int)

In [13]:
data["Age"]=data["Age"].astype(int)

In [14]:
data.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked,familySize,IsAlone
0,1,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7.2500,S,1,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,71.2833,C,1,0

In [15]:
data.to_csv("titanic_cleaned.csv",index=False)
print(f"Cleaned Data saved.")

Cleaned Data saved.